#include "SH79F328.h"
#include"cpu.h"
extern void init_Crc();
void init_Crc(void)
{

    CRCDL = 0x55;
    CRCDH = 0xAA;
/****************************************************************************************
1. 允许CRC中断
*****************************************************************************************/
    IEN2 |= 0x04;
	EA = 1;
/**************************************************************************************************
1. CRC控制寄存器
bit7:   CRC_GO	 CRC启动控制位         0：关闭CRC模块 
                                       1：启动CRC模块,CRC校验完成后自动清0

 
bit6:   CRCIF	CRC完成中断请求标志位       0：未启动或启动后未完成。
                                            1：CRC校验完成，向CPU请求中断，如果中断允许位ECRC为1，
                                               则CPU响应中断，程序响应中断后此标志位软件清0。
 
2. 启动CRC模块
**************************************************************************************************/
    if(!(CRCCON & 0x80))
    {
        CRCCON |= 0x80;
    }
}